# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  - [ -1, 1, Conv, [ 3, 1, 1 ] ] #0
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] #1
  - [ -1, 1, Conv, [ 128, 3, 2 ] ]  #2
  - [ -1, 3, C2f, [ 128, True] ] #3
  - [ -1, 1, Conv, [ 256, 3, 2 ] ]  #4
  - [ -1, 6, C2f, [ 256, True, ] ] #5
  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  #6
  - [ -1, 6, C2f, [ 512,True, ] ] #7
  - [ -1, 1, Conv, [ 1024, 3, 2 ] ] #8
  - [ -1, 3, C2f, [ 1024, True, ] ] #9
  - [ -1, 1, SPPF, [1024, 5]] #10


  - [ 0, 1, Conv, [ 64, 3, 2 ] ]  #11
  - [ -1, 1, Conv, [ 128, 3, 2 ] ]  #12
  - [ -1, 3, C2f, [ 128, True ] ] #13
  - [ -1, 1, Conv, [ 256, 3, 2 ] ]  #14
  - [ -1, 6, C2f, [ 256, True ] ] # 15
  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  #16
  - [ -1, 6, C2f, [ 512,True] ] #17
  - [ -1, 1, Conv, [ 1024, 3, 2 ] ]  #18
  - [ -1, 3, C2f, [ 1024, True] ] #19
  - [ -1, 1, SPPF, [1024, 5]] #20

  # [from, repeats, module, args]
  - [0, 1, Conv, [64, 3, 2]] #21
  - [-1, 1, Conv, [128, 3, 2]]  #22
  - [-1, 3, C2f, [128, True]] #23
  - [-1, 1, Conv, [256, 3, 2]]  #24
  - [-1, 6, C2f, [256, True]] #25
  - [[-1, 5, 15],1, DABlock,[]] #26
  - [-1, 1, Conv, [512, 3, 2]] #27
  - [-1, 6, C2f, [512, True]] #28
  - [[-1, 7, 17],1, DABlock,[]] #29
  - [-1, 1, Conv, [1024, 3, 2]]  #30
  - [-1, 3, C2f, [1024, True]] #31
  - [[-1, 10, 20],1, DABlock,[]] #32
  - [-1, 1, SPPF, [1024, 5]]  #33

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #34
  - [[-1, 29], 1, Concat, [1]] #35
  - [-1, 3, C2f, [512]] #36

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #37
  - [[-1, 26], 1, Concat, [1]] #38
  - [-1, 3, C2f, [256]] #39

  - [-1, 1, Conv, [256, 3, 2]] #40
  - [[-1, 36], 1, Concat, [1]]  #41
  - [-1, 3, C2f, [512]]  #42

  - [-1, 1, Conv, [512, 3, 2]] #43
  - [[-1, 33], 1, Concat, [1]] #44
  - [-1, 3, C2f, [1024]] #45

  - [[5, 7, 10, 15, 17, 20, 39, 42, 45], 1, Detect, [nc]] # Detect(P3, P4, P5)








## Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
## Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
## Model docs: https://docs.ultralytics.com/models/yolov8
## Task docs: https://docs.ultralytics.com/tasks/detect
#
## Parameters
#nc: 3 # number of classes
#scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
#  # [depth, width, max_channels]
#  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
#  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
#  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
#  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
#  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
#
## YOLOv8.0n backbone
#backbone:
#  - [ -1, 1, Conv, [ 3, 1, 1 ] ] #0
#  - [ -1, 1, Conv, [ 64, 3, 2 ] ] #1
#  - [ -1, 1, Conv, [ 128, 3, 2 ] ]  #2
#  - [ -1, 3, C2f, [ 128, True] ] #3
#  - [ -1, 1, Conv, [ 256, 3, 2 ] ]  #4
#  - [ -1, 1, Block, [True]] # 5
#  - [ -1, 6, C2f, [ 256, True] ] #6
#  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  #7
#  - [ -1, 1, Block, [True]] #8
#  - [ -1, 6, C2f, [ 512, True] ] #9
#  - [ -1, 1, Conv, [ 1024, 3, 2 ] ] #10
#  - [ -1, 1, Block, [True]] # 11
#  - [ -1, 3, C2f, [ 1024,True] ] #12
#  - [ -1, 1, SPPF, [1024, 5]] #13
#
#
#  - [ 0, 1, Conv, [ 64, 3, 2 ] ]  #14
#  - [ -1, 1, Conv, [ 128, 3, 2 ] ]  #15
#  - [ -1, 3, C2f, [ 128, True ] ] #16
#  - [ -1, 1, Conv, [ 256, 3, 2 ] ]  #17
#  - [ -1, 1, Block, [False]] #18
#  - [ -1, 6, C2f, [ 256 ] ] # 19
#  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  #20
#  - [ -1, 1, Block, [False]] #21
#  - [ -1, 6, C2f, [ 512, True] ] #22
#  - [ -1, 1, Conv, [ 1024, 3, 2 ] ]  #23
#  - [ -1, 1, Block, [False]] #24
#  - [ -1, 3, C2f, [ 1024, True] ] #25
#  - [ -1, 1, SPPF, [1024, 5]] #26
#
#  # [from, repeats, module, args]
#  - [0, 1, Conv, [64, 3, 2]] #27
#  - [-1, 1, Conv, [128, 3, 2]]  #28
#  - [-1, 3, C2f, [128, True]] #29
#  - [-1, 1, Conv, [256, 3, 2]]  #30
#  - [-1, 6, C2f, [256, True]] #31
#  - [[-1, 6, 19],1, DABlock,[]] #32
#  - [-1, 1, Conv, [512, 3, 2]] #33
#  - [-1, 6, C2f, [512, True]] #34
#  - [[-1, 9, 22],1, DABlock,[]] #35
#  - [-1, 1, Conv, [1024, 3, 2]]  #36
#  - [-1, 3, C2f, [1024, True]] #37
#  - [[-1, 13, 26],1, DABlock,[]] #38
#  - [-1, 1, SPPF, [1024, 5]]  #39
#
## YOLOv8.0n head
#head:
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #40
#  - [[-1, 29], 1, Concat, [1]] #41
#  - [-1, 3, C2f, [512]] #42
#
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #43
#  - [[-1, 26], 1, Concat, [1]] #44
#  - [-1, 3, C2f, [256]] #45
#
#  - [-1, 1, Conv, [256, 3, 2]] #46
#  - [[-1, 36], 1, Concat, [1]]  #47
#  - [-1, 3, C2f, [512]]  #48
#
#  - [-1, 1, Conv, [512, 3, 2]] #49
#  - [[-1, 33], 1, Concat, [1]] #50
#  - [-1, 3, C2f, [1024]] #51
#
#  - [[6, 9, 13, 19, 22, 26, 45, 48, 51], 1, Detect, [nc]] # Detect(P3, P4, P5)



